# SQL Practice
### Exploratory Data Analysis

In [2]:
#configure jupyter notebook to run SQL commands
%load_ext sql

In [3]:
#connect to database
#database is a sqlite database file stored locally, 
#it is a open source db, refer to README for download location
%sql sqlite:////Users/admin/personal_projs/sql_practice/data/Chinook_Sqlite.sqlite

'Connected: @/Users/admin/personal_projs/sql_practice/data/Chinook_Sqlite.sqlite'

In [4]:
%sql SELECT * FROM Track LIMIT 5;

 * sqlite:////Users/admin/personal_projs/sql_practice/data/Chinook_Sqlite.sqlite
Done.

[(1, 'For Those About To Rock (We Salute You)', 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 343719, 11170334, 0.99),
 (2, 'Balls to the Wall', 2, 2, 1, None, 342562, 5510424, 0.99),
 (3, 'Fast As a Shark', 3, 2, 1, 'F. Baltes, S. Kaufman, U. Dirkscneider & W. Hoffman', 230619, 3990994, 0.99),
 (4, 'Restless and Wild', 3, 2, 1, 'F. Baltes, R.A. Smith-Diesel, S. Kaufman, U. Dirkscneider & W. Hoffman', 252051, 4331779, 0.99),
 (5, 'Princess of the Dawn', 3, 2, 1, 'Deaffy & R.A. Smith-Diesel', 375418, 6290521, 0.99)]

---

Practice Q's from https://www.chegg.com/homework-help/questions-and-answers/question-1-using-chinook-database-write-sql-select-queries-answer-following-questions-need-q29407465

**1. What is the title of the album with AlbumId 31?**

In [5]:
%%sql result <<
SELECT Title
FROM Album
Where AlbumId = 31;

 * sqlite:////Users/admin/personal_projs/sql_practice/data/Chinook_Sqlite.sqlite
Done.
Returning data to local variable result

In [6]:
result

[('Bongo Fury',)]

**2. List all the albums by artists with the word ‘black’ in their name.**

In [7]:
%%sql result <<
SELECT Album.Title
FROM Album 
JOIN Artist
ON Album.ArtistId = Artist.ArtistId
WHERE Artist.Name LIKE "%black%";

 * sqlite:////Users/admin/personal_projs/sql_practice/data/Chinook_Sqlite.sqlite
Done.
Returning data to local variable result

In [8]:
result

[('Alcohol Fueled Brewtality Live! [Disc 1]',),
 ('Alcohol Fueled Brewtality Live! [Disc 2]',),
 ('Black Sabbath',),
 ('Black Sabbath Vol. 4 (Remaster)',),
 ('Live [Disc 1]',),
 ('Live [Disc 2]',)]

**3. Find the name and length (in seconds) of all tracks that have both length between 30 and 40 seconds, and genre Latin.**

In [9]:
%%sql result <<
SELECT Track.Name, Milliseconds/1000 AS seconds
FROM Track
JOIN Genre
ON Track.GenreId = Genre.GenreId
WHERE seconds BETWEEN 30 AND 40
AND
Genre.Name = "Latin";

 * sqlite:////Users/admin/personal_projs/sql_practice/data/Chinook_Sqlite.sqlite
Done.
Returning data to local variable result

In [10]:
result

[('Mateus Enter', 33), ('Deixa Entrar', 33)]

**4. Produce a table that lists each country and the number of customers in that country. (You only need to include countries that have customers.)**

In [11]:
%%sql result <<
SELECT COUNT(*) AS total_customers, Country
FROM Customer
GROUP BY Country
HAVING total_customers > 0;

 * sqlite:////Users/admin/personal_projs/sql_practice/data/Chinook_Sqlite.sqlite
Done.
Returning data to local variable result

In [12]:
result

[(1, 'Argentina'),
 (1, 'Australia'),
 (1, 'Austria'),
 (1, 'Belgium'),
 (5, 'Brazil'),
 (8, 'Canada'),
 (1, 'Chile'),
 (2, 'Czech Republic'),
 (1, 'Denmark'),
 (1, 'Finland'),
 (5, 'France'),
 (4, 'Germany'),
 (1, 'Hungary'),
 (2, 'India'),
 (1, 'Ireland'),
 (1, 'Italy'),
 (1, 'Netherlands'),
 (1, 'Norway'),
 (1, 'Poland'),
 (2, 'Portugal'),
 (1, 'Spain'),
 (1, 'Sweden'),
 (13, 'USA'),
 (3, 'United Kingdom')]

**5. Find the top five customers in terms of sales i.e. find the five customers whose total combined invoice amounts are the highest.**

In [13]:
%%sql result <<
SELECT FirstName || ' ' || LastName
FROM Customer
JOIN Invoice
ON Customer.CustomerId = Invoice.CustomerId
ORDER BY Invoice.Total DESC
LIMIT 5;

 * sqlite:////Users/admin/personal_projs/sql_practice/data/Chinook_Sqlite.sqlite
Done.
Returning data to local variable result

In [14]:
result

[('Helena Holý',),
 ('Richard Cunningham',),
 ('Ladislav Kovács',),
 ("Hugh O'Reilly",),
 ('Astrid Gruber',)]

**6. For each genre of music, determine how many customers have bought at least one track from that genre.**

In [15]:
#group by genre, customerid
#make sure sum of quantity > 1
#subquery

In [21]:
%%sql result <<
SELECT COUNT(c.CustomerId) AS total_customers, 
Genre.Name
FROM Customer c
JOIN Invoice
ON c.CustomerId = Invoice.CustomerId
JOIN InvoiceLine
ON Invoice.InvoiceId = InvoiceLine.InvoiceId
JOIN Track
ON InvoiceLine.TrackId = Track.TrackId
JOIN Genre 
ON Track.GenreId = Genre.GenreId
GROUP BY Genre.Name
HAVING SUM(InvoiceLine.Quantity) >= 1;

 * sqlite:////Users/admin/personal_projs/sql_practice/data/Chinook_Sqlite.sqlite
Done.
Returning data to local variable result

In [22]:
result

[(14, 'Alternative'),
 (244, 'Alternative & Punk'),
 (61, 'Blues'),
 (15, 'Bossa Nova'),
 (41, 'Classical'),
 (9, 'Comedy'),
 (29, 'Drama'),
 (10, 'Easy Listening'),
 (12, 'Electronica/Dance'),
 (12, 'Heavy Metal'),
 (17, 'Hip Hop/Rap'),
 (80, 'Jazz'),
 (386, 'Latin'),
 (264, 'Metal'),
 (28, 'Pop'),
 (41, 'R&B/Soul'),
 (30, 'Reggae'),
 (835, 'Rock'),
 (6, 'Rock And Roll'),
 (20, 'Sci Fi & Fantasy'),
 (6, 'Science Fiction'),
 (20, 'Soundtrack'),
 (47, 'TV Shows'),
 (13, 'World')]